app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = $1  [["user_id", 6]]
---
  def index
    @songs = current_user.songs.all

INSERT INTO "songs" ("user_id", "stream_url", "title", "artist", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @song = Song.create(song_params)

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]
---
  def destroy
    @song = Song.find(params[:id])
    @song.destroy