app/controllers/users_controller.rb

  def load_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("password_digest", "firstname", "lastname", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"